-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: it.vshp.online    Database: db_0c733f
-- ------------------------------------------------------
-- Server version	8.0.32-0ubuntu0.22.04.2

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `books`
--

DROP TABLE IF EXISTS `books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `books` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `year` int DEFAULT NULL,
  `shelves_id` int unsigned DEFAULT NULL,
  `friends_id` int unsigned DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_books_shelves_idx` (`shelves_id`),
  KEY `fk_books_friends_idx` (`friends_id`),
  CONSTRAINT `fk_books_friends` FOREIGN KEY (`friends_id`) REFERENCES `friends` (`id`),
  CONSTRAINT `fk_books_shelves` FOREIGN KEY (`shelves_id`) REFERENCES `shelves` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=177 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `books`
--

LOCK TABLES `books` WRITE;
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` VALUES (1,'1984',1949,1,2),(2,'Анна Каренина',1877,2,NULL),(3,'Лолита',1955,1,NULL),(4,'Война и мир',1869,1,NULL),(5,'Рассказы',1890,4,1),(6,'Рассказы',1912,2,NULL),(7,'Рассказы',1836,1,NULL),(8,'Тысяча и одна ночь',NULL,1,NULL),(9,'Божественная комедия',NULL,1,1),(10,'Сказки',NULL,3,NULL),(11,'И пришло разрушение',1958,3,NULL),(12,'Отец Горио',1835,2,NULL),(13,'Трилогия',NULL,4,NULL),(14,'Декамерон',NULL,4,NULL),(15,'Вымыслы',NULL,4,NULL),(16,'Грозовой перевал',1847,4,NULL),(17,'Рамаяна',NULL,1,NULL),(18,'Энеида',NULL,4,NULL),(19,'Миссис Дэллоуэй',1925,1,NULL),(20,'На маяк',1927,3,NULL),(21,'Махабхарата',NULL,2,NULL),(22,'Голод',1890,4,NULL),(23,'Цыганское романсеро',1928,2,NULL),(24,'Сто лет одиночества',1967,1,NULL),(25,'Любовь во время чумы',1985,1,NULL),(26,'Фауст',1832,4,NULL),(27,'Тропы по большому сертану',1956,2,NULL),(28,'Мёртвые души',1842,1,NULL),(29,'Жестяной барабан',1959,2,NULL),(30,'Берлин Александрплац',1929,3,NULL),(31,'Улисс',1922,1,NULL),(32,'Жак-фаталист и его хозяин',1796,3,NULL),(33,'Большие надежды',1861,1,NULL),(34,'Преступление и наказание',1866,2,NULL),(35,'Идиот',1869,4,NULL),(36,'Бесы',1872,2,NULL),(37,'Братья Карамазовы',1880,2,NULL),(38,'Медея',NULL,2,NULL),(39,'Самопознание Дзено',1923,4,NULL),(40,'Кукольный дом',1879,3,NULL),(41,'Стон горы',1954,4,NULL),(42,'Невероятные похождения Алексиса Зорбаса',1946,1,NULL),(43,'Шакунтала',NULL,2,NULL),(44,'Посторонний',1942,3,NULL),(45,'Процесс',1925,4,NULL),(46,'Замок',1926,1,NULL),(47,'Ностромо',1904,3,NULL),(48,'Самостоятельные люди',NULL,1,NULL),(49,'Стихи',1818,1,NULL),(50,'Золотая тетрадь',1962,4,NULL),(51,'Пеппи Длинныйчулок',1945,1,NULL),(52,'Сыновья и любовники',1913,2,NULL),(53,'Записки сумасшедшего',1918,4,NULL),(54,'Будденброки',1901,3,NULL),(55,'Волшебная гора',1924,1,NULL),(56,'Предания нашей улицы',1959,4,NULL),(57,'Моби Дик',1851,2,NULL),(58,'Опыты',1595,4,NULL),(59,'История',1974,4,NULL),(60,'Возлюбленная',1987,1,NULL),(61,'Человек без свойств',NULL,1,NULL),(62,'Метаморфозы',NULL,3,NULL),(63,'Книга непокоя',NULL,3,NULL),(64,'В поисках утраченного времени',NULL,2,NULL),(65,'Гаргантюа и Пантагрюэль',NULL,1,NULL),(66,'Педро Парамо',1955,2,NULL),(67,'Маснави',NULL,4,NULL),(68,'Дети полуночи',1981,3,NULL),(69,'Гордость и предубеждение',1813,4,NULL),(70,'Бустан',1257,4,NULL),(71,'Сезон паломничества на Север',1966,3,NULL),(72,'Слепота',1995,4,NULL),(73,'Путешествия Гулливера',1726,1,NULL),(74,'Путешествие на край ночи',1932,4,NULL),(75,'Хитроумный идальго Дон Кихот Ламанчский',NULL,1,NULL),(76,'Повесть о блистательном принце Гэндзи',NULL,2,NULL),(77,'Эдип-царь',NULL,3,NULL),(78,'Красное и чёрное',1830,3,NULL),(79,'Жизнь и мнения джентльмена Тристрама Шенди',1760,2,NULL),(80,'Приключения Гекльберри Финна',1884,3,NULL),(81,'Смерть Ивана Ильича',1886,3,NULL),(82,'Листья травы',1855,3,NULL),(83,'Госпожа Бовари',1857,1,NULL),(84,'Воспитание чувств',1869,4,NULL),(85,'Авессалом-Авессалом!',1936,3,NULL),(86,'Шум и ярость',1929,1,NULL),(87,'Старик и море',1952,4,NULL),(88,'Стихотворения',1952,1,NULL),(89,'Кентерберийские рассказы',NULL,2,NULL),(90,'Гамлет',1603,4,NULL),(91,'Король Лир',1608,1,NULL),(92,'Отелло',1609,3,NULL),(93,'Мидлмарч',1871,4,NULL),(94,'Человек-невидимка',1952,3,NULL),(95,'Воспоминания Адриана',1951,3,NULL),(96,'Невидимка',1952,2,NULL),(97,'К маяку',1927,4,NULL),(98,'Иллиада и Одиссея',NULL,4,NULL),(99,'Божественная комедия',1321,4,NULL),(100,'Миддлмарч',1874,1,NULL),(101,'Распад',1958,1,NULL),(102,'Над пропастью во ржи',1951,4,NULL),(103,'Унесённые ветром',1936,3,NULL),(104,'Великий Гэтсби',1925,4,NULL),(105,'Уловка 22',1961,3,NULL),(106,'Гроздья гнева',1939,1,NULL),(107,'Дивный новый мир',1932,2,NULL),(108,'Сын Америки',1940,3,NULL),(109,'Демократия в Америке',1835,1,NULL),(110,'Происхождение видов',1859,1,NULL),(111,'Общественный договор',1762,3,NULL),(112,'Капитал',1867,1,NULL),(113,'Государь',1532,3,NULL),(114,'Левиафан',1651,3,NULL),(115,'Властелин колец',1954,4,NULL),(116,'Винни-Пух',1926,2,NULL),(117,'Лев, колдунья и платяной шкаф',1950,1,NULL),(118,'Поездка в Индию',1924,4,NULL),(119,'В дороге',1957,1,NULL),(120,'Убить пересмешника',1960,1,NULL),(121,'Заводной апельсин',1962,2,NULL),(122,'Свет в августе',1932,3,NULL),(123,'Души чёрного народа',1903,4,NULL),(124,'Безбрежное Саргассово море',1966,4,NULL),(125,'Мадам Бовари',1857,4,NULL),(126,'Потерянный рай',1667,3,NULL),(127,'Сонеты',1609,2,NULL),(128,'Ким',1901,3,NULL),(129,'Франкенштейн',1818,2,NULL),(130,'Песнь Соломона',1977,2,NULL),(131,'Пролетая над гнездом кукушки',1962,4,NULL),(132,'По ком звонит колокол',1940,4,NULL),(133,'Бойня номер пять',1969,3,NULL),(134,'Скотный двор',1945,2,NULL),(135,'Повелитель мух',1954,4,NULL),(136,'Хладнокровное убийство',1965,3,NULL),(137,'В поисках потерянного времени',1913,3,NULL),(138,'Большой сон',1939,2,NULL),(139,'Когда я умирала',1930,1,NULL),(140,'Фиеста',1926,4,NULL),(141,'Я, Клавдий',1934,3,NULL),(142,'Сердце — одинокий охотник',1940,3,NULL),(143,'И вся королевская рать',1946,2,NULL),(144,'Иди, вещай с горы',1953,2,NULL),(145,'Паутина Шарлотты',1952,1,NULL),(146,'Сердце тьмы',1902,2,NULL),(147,'Ночь',1958,2,NULL),(148,'Кролик, беги',1960,4,NULL),(149,'Эпоха невинности',1920,2,NULL),(150,'Случай портного',1969,3,NULL),(151,'Американская трагедия',1925,2,NULL),(152,'День саранчи',1939,2,NULL),(153,'Тропик рака',1934,4,NULL),(154,'Мальтийский сокол',1930,4,NULL),(155,'Тёмные начала',1995,1,NULL),(156,'Смерть пришла архиепископу',1927,3,NULL),(157,'Толкования снов',1900,2,NULL),(158,'Воспитание Генри Адамса',1918,4,NULL),(159,'Цитатник',1964,3,NULL),(160,'Многообразие религиозного опыта',1902,4,NULL),(161,'Возвращение в Брайдсхед',1945,2,NULL),(162,'Безмолвная весна',1962,3,NULL),(163,'Общая теория занятости, процента и денег',1936,1,NULL),(164,'Лорд Джим',1900,3,NULL),(165,'Простимся со всем этим',1929,3,NULL),(166,'Общество изобилия',1958,2,NULL),(167,'Ветер в ивах',1908,3,NULL),(168,'Автобиография Малколма Икс',1965,3,NULL),(169,'Выдающиеся викторианцы',1918,4,NULL),(170,'Цвет пурпурный',1982,4,NULL),(171,'Вторая мировая война',1948,3,NULL),(172,'1984',1949,1,NULL),(173,'Анна Каренина',1877,1,NULL),(174,'Лолита',1957,2,NULL),(175,'Война и мир',1950,1,NULL),(176,'Краткие ответы на большие вопросы',2020,1,NULL);
/*!40000 ALTER TABLE `books` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-05-02  9:46:16
